import "./important-matches.css"

const ImportantMatches = () => {
  return (
    <div className="important-matches container pt-5 pb-4">
      <h3 className="heading pt-4">اهم مبارايات اليوم</h3>
      <div className="content pt-3 pb-1 px-3 rounded-2">
        <p>
          تتجه أنظار عشاق كرة القدم اليوم إلى مجموعة من المباريات المثيرة التي تشهدها الملاعب حول العالم. تعتبر هذه المباريات فرصة رائعة للفرق لتقديم أداء قوي في إطار المنافسات المحلية والدولية. في هذا المقال، سنستعرض أهم مباريات اليوم وكيف يمكن أن تؤثر على جدول الدوري.
        </p>
        <p>
          تُعد المباريات التي تُقام اليوم جزءًا لا يتجزأ من الأحداث الرياضية الكبرى، حيث يلتقي فيها فرق قوية تتنافس على نقاط حيوية. إليك بعض التفاصيل حول المباريات المرتقبة:
        </p>
        <table>
          <thead>
            <tr>
              <th>الوقت</th>
              <th>الفريق الأول</th>
              <th>الفريق الثاني</th>
              <th>نتيجة المباراة</th>
            </tr>
          </thead>
          <tfoot>
            <tr>
              <td>2:30 م</td>
              <td>بريستون نورث إيند</td>
              <td>ليدز يونايتد</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>5:00 م</td>
              <td>الاهلي</td>
              <td>الزمالك</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>2:30 م</td>
              <td>بريستون نورث إيند</td>
              <td>ليدز يونايتد</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>5:00 م</td>
              <td>الاهلي</td>
              <td>الزمالك</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>2:30 م</td>
              <td>بريستون نورث إيند</td>
              <td>ليدز يونايتد</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>5:00 م</td>
              <td>الاهلي</td>
              <td>الزمالك</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>2:30 م</td>
              <td>بريستون نورث إيند</td>
              <td>ليدز يونايتد</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>5:00 م</td>
              <td>الاهلي</td>
              <td>الزمالك</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>2:30 م</td>
              <td>بريستون نورث إيند</td>
              <td>ليدز يونايتد</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>5:00 م</td>
              <td>الاهلي</td>
              <td>الزمالك</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>2:30 م</td>
              <td>بريستون نورث إيند</td>
              <td>ليدز يونايتد</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>5:00 م</td>
              <td>الاهلي</td>
              <td>الزمالك</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>2:30 م</td>
              <td>بريستون نورث إيند</td>
              <td>ليدز يونايتد</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>5:00 م</td>
              <td>الاهلي</td>
              <td>الزمالك</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>2:30 م</td>
              <td>بريستون نورث إيند</td>
              <td>ليدز يونايتد</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>5:00 م</td>
              <td>الاهلي</td>
              <td>الزمالك</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>2:30 م</td>
              <td>بريستون نورث إيند</td>
              <td>ليدز يونايتد</td>
              <td>0 : 0</td>
            </tr>
            <tr>
              <td>5:00 م</td>
              <td>الاهلي</td>
              <td>الزمالك</td>
              <td>0 : 0</td>
            </tr>
        </tfoot>
        </table>
        <p className="pt-4">
          من المهم متابعة هذه المباريات لمعرفة كيف ستؤثر على نتائج الدوري. لذا، كن مستعدًا للاستمتاع بأجواء حماسية خلال هذه المباريات، ولا تنسَ مشاركة آرائك حول الفرق المفضلة لديك. مع اقتراب صافرة البداية، سيكون لديك فرصة لمشاهدة مهارات لاعبيك المفضلين في الملعب.
        </p>
        <p>
          في النهاية، تمثل مباريات اليوم أكثر من مجرد أحداث رياضية، فهي تجمع عشاق كرة القدم حول العالم وتمنحهم الفرصة للاستمتاع بأفضل اللحظات الرياضية.
        </p>
        <h3>مشاهدة المباريات عبر موقع هاتريك لايف لبث المباريات</h3>
        <p>
          مع أسطورة البث المباشر ، يمكنك متابعة فريقك المفضل في أي وقت وأي مكان من الموبايل او الجوال او الكمبيوتر و الجهاز اللوحي .
        </p>
        <h3>
          هاتريك مباشر لبث المباريات بجودة متعددة 
        </h3>
        <p>
          يوفر هاتريك مباشر لبث المباريات تغطية شاملة لجميع البطولات، بما في ذلك الدوري الإنجليزي، الإسباني، ودوري أبطال أوروبا. يتميز موقع هاتريك بجدول محدث يوميًا يعرض تفاصيل المباريات، توقيتاتها، والقنوات الناقلة. إذا كنت من عشاق الرياضة، فإن هاتريك مباشر يمنحك تجربة مشاهدة رائعة دون أي تقطيع.
        </p>
        <h3>روابط هاتريك مباشر لبث المباريات</h3>
        <p>
          للحصول على تجربة بث مستقرة وممتعة، يوفر روابط هاتريك مباشر لبث المباريات  سيرفرات سريعة تناسب مختلف الأجهزة. سواء كنت تستخدم الهاتف المحمول أو الكمبيوتر، فإن هاتريك مباشر لبث المباريات يقدم لك مشاهدة ممتعة دون تقطيع.
        </p>
        <h3>
          هاتريك مباشر لنقل المباريات 
        </h3>
        <p>
          يقدم هاتريك مباشر لنقل المباريات تجربة فريدة لعشاق كرة القدم. مع اسطورة البث المباشر للمباريات ، يمكنك مشاهدة المباريات بجودة عالية وبدون تقطيع. احصل الآن على تجربة بث لا مثيل لها مع هاتريك مباشر لبث المباريات المباشر .
        </p>
      </div>
      
    </div>
  )
}

export default ImportantMatches
