import { useEffect } from "react"
import "./contact-us.css"
const ContactUs = () => {

  useEffect(() => {
    window.scrollTo(0, 0)
  }, [])

  return (
    <div className="contact-us py-5 container">
      <h2>اتصل بنا</h2>
      <ul>
        <li>الرساله من نموذج الاتصال التالي يتم ارساله بشكل مباشر وفوري للبريد الالكتروني الخاص باداة الموقع.</li>
        <li>لا يتم حفظ عنوان البريد الالكتروني ضمن سجلاتنا ولا يتم ارسال اى علانات علي الايميل الخاص بك.</li>
        <li>نرجو منكم عدم ارسال الرساله اكثر من مره في حالة تاخر الرد وذلك حتي لايتم حذف الرساله.</li>
        <li>برجاء اختيار عنوان مناسب للرساله يوضح بختصار محتوي الرساله لكي يسهل علينا الوصول لها.</li>
        <li>يفضل ان تكون الرساله مختصره قدر الامكان وذلك حتي يسهل معرفة محتويها واى تفاصيل سوف يتم طلبها.</li>
      </ul>
      <h3>elmomtaz44@gmail.com</h3>
    </div>
  )
}

export default ContactUs
