import { createBrowserRouter } from "react-router-dom";
import MainLayout from "../layout/main-layout/MainLayout";
import Home from "../pages/Home";
import LatestNews from "../component/latest-news/LatestNews";
import TodayMatches from "../component/today-matches/TodayMatches";
import Section from "../component/section/Section";
import RankTable from "../component/rank-table/RankTable";
import LatestNews2 from "../component/latest-news2/LatestNews2";
import PrivacyPolicy from "../component/privacy-policy/PrivacyPolicy";
import ContactUs from "../component/contact-us/ContactUs";
import AboutUs from "../component/about-us/AboutUs";
import NewsDetails from "../component/news-details/NewsDetails";

export const router = createBrowserRouter([
  {
    path: "/",
    element: <MainLayout />,
    children: [
      {
        index: true,
        element: <Home />,
      },
      {
        path: "news",
        element: <LatestNews />,
      },
      {
        path: "news/page/2",
        element: <LatestNews2 />,
      },
      {
        path: "/matches-today",
        element:
          <>
            <TodayMatches />
            <Section
              title="لماذا نتابع أخبار مباريات كرة القدم بهذا الشغف؟"
              description="يعرف جميع مشجعي كرة القدم أن الأمر يفوق مجرد التسلية أو التشجيع بحكم الانتماء والهوية. وأن السبب الذي يجعلنا لا نتوقف عن متابعة أخبار الرياضة ومباريات اليوم مهما كانت مشاغلنا الحياتية لا يمكن تفسيره بالمنطق أو التعبير عنه بكلمات. من ينسى تلك اللحظات التي نعيشها قبل المباريات الحاسمة ومشاعر الترقب التي تملؤنا؟ أو النشوة التي نشعر بها عندما يحرز فريقنا هدفًا، أو مشاعر الخيبة واليأس عندما يخسر الفريق الذي نشجعه.
              هناك الكثير من الاهتمامات المختلفة لدى البشر لكن هذه اللعبة تختلف عن أي شيء آخر. فهي قادرة على تحريك عواطفنا وإثارة شغفنا لأقصى حد، لدرجة تجعل من أخبار مباريات اليوم أهم من الأخبار السياسية بل ومن أمورنا الشخصية. انظر إلى البلاد التي أنهكتها الحروب وكيف يهتم الأطفال بممارسة كرة القدم ومتابعتها رغم كل شيء لتعرف ما نتحدث عنه. لم لا وهي الساحرة المستديرة والمعشوقة الأولى للملايين في جميع أنحاء العالم. مع الأهمية الكبرى التي تمثلها هذه اللعبة في حياتنا فأنت لا تريد أن يفوتك شيء. لذا جمعنا لك كل ما تحتاج لمعرفته من معلومات وأخبار ونتائج في مكان واحد دون الحاجة لترهق نفسك في البحث عنها. لأننا أيضًا نشاركك نفس الشغف بكرة القدم.
              أين يمكنك متابعة أخبار المباراه اليوم لحظة بلحظة؟ يوجد فرق هائل بين حضور مباراة في الاستاد وبين مشاهدتها عبر الشاشات. يكمن السر في التفاصيل الصغيرة التي لا تنقلها الكاميرات. كواليس ما قبل المباراة، الحالة البدنية للاعبين، ردود الأفعال وتفاعل الجماهير، أجواء المنافسة والحماس. كل هذا ستجده في موقع كووورة 4 لايف كأنك تحضر المباريات من قلب الملعب. ولكن الأمر لا يقتصر على أخبار الماتش اليوم فقط. بل تمتد تغطيتنا لتشمل جميع المباريات في جميع دوريات وبطولات العالم لحظة بلحظة. نحن نقدم متابعة حية لجميع اخبار الرياضه ومباريات اليوم من البطولات العالمية الكبرى مثل كأس العالم والبطولات القارية مثل دوري أبطال أوروبا ودوري أبطال أفريقيا ودوري أبطال آسيا إلى الدوريات في جميع أنحاء الكرة الأرضية. الدوري الأسباني والدوري الإنجليزي والدوريات العربية الدوري الإماراتي والدوري السعودي والدوري المصري ليست سوى أمثلة على عشرات البطولات التي تشملها تغطيتنا المباشرة. أيًا كان اسم المنتخب أو الفريق الذي تشجعه ستجد أننا نسلط الضوء على جميع أخباره ونتائجه ونقدم لك تحليلات الخبراء حول مستوى أدائه وتوقعاتهم له في المراحل المقبلة. ما الذي يميز تغطيتنا لجميع أخبار ماتشات اليوم؟ في ظل العدد الهائل من المواقع التي تغطي أخبار اللعبة ونتائج مبارياتها، نحن نعتبر الأمر بمثابة مباراة من نوع خاص. ونسعى دائمًا لنكون الفريق الفائز. والعوامل التي تساعدنا على ذلك كثيرة نذكر منها مثلًا: § الأخبار الحصرية: نحن نعتمد على شبكة كبيرة من المراسلين في كل مكان. كما أن لدينا اتصالات واسعة بالعديد من مصادر الأخبار الهامة وثيقة الصلة بأبرز الفرق واللاعبين. § المصداقية: رغم حرصنا على أن نكون أول من ينقل جميع الأخبار، إلا أننا نحرص قبل كل شيء على المصداقية، ونقل الأخبار عن مصادرها الموثوقة. § التغطية الشاملة: تشمل تغطيتنا جميع البطولات وكافة الفرق والمنتخبات في جميع أنحاء العالم. لكن هذا ليس كل شيء لأننا ننقل كل التفاصيل المتعلقة بما قبل وبعد وأثناء المباريات. ستجد كل ما تريد معرفته من معلومات واخبار اليوم كورة في مكان واحد. إن كرة القدم رغم مكانتها الفريدة لم تكن لتساوي شيئًا دون الجمهور! نعم عزيزي المشجع أنت لست اللاعب رقم 12 فحسب، بل أنت أهم لاعب في فريقك. نحن نقدر قيمتك ونعرف أهمية حصولك على تفاصيل وأخبار ماتشات اليوم في الوقت المناسب. ورغم تغطيتنا الشاملة إلا أننا في موقع كورة 4 لايف نحرص دائمًا على التطوير المستمر. لذا إذا كانت لديك أية اقتراحات أو أفكار لا تتردد في الاتصال بنا مباشرةً أو عبر وسائل التواصل الاجتماعي فيسبوك وتويتر."
            />
          </>
      },
      {
        path: "/leagues-rank",
        element: <RankTable type="ترتيب الفرق" />
      },
      {
        path: "/scorers-rank",
        element: <RankTable type="ترتيب الهدافين" />
      },
      {
        path: "/privacy-policy",
        element: <PrivacyPolicy />
      },
      {
        path: "/contact-us",
        element: <ContactUs />
      },
      {
        path: "/about-us",
        element: <AboutUs />
      },
      {
        path: "/details/:id",
        element: <NewsDetails />
      }
    ]
  }
])