import { Link } from "react-router-dom"
import "./privacy-policy.css"
import { useEffect } from "react"
const PrivacyPolicy = () => {

  useEffect(() => {
    window.scrollTo(0, 0)
  }, [])

  return (
    <div className="privacy-policy container py-5">
      <h2>سياسة الخصوصية</h2>
      <p>
        عند تصفحك لموقعنا، وارسالك لبيانات تخصك مثلا مراسلتنا عبر بريدك الالكتروني فإنك تأتمننا على معلوماتك. نحن ندرك أن هذه مسؤولية كبيرة ونعمل بجدية لحماية معلوماتك ونمنحك التحكم فيها.
        تهدف سياسةُ الخصوصية هذه إلى مساعدتك على فهم ما هيه المعلومات التي نجمعها وسبب جمعنا لها، وكذلك طريقة تحديث معلوماتك وتصديرها وحذفها.
        تمت صياغة سياسة الخصوصية هذه لتظهر مدى التزامنا لزوارنا بخصوصيتهم الكاملة وعدم انتهاكنا لأي أمر من شأنه الإخلال بخصوصيتهم.
        + البيانات التي يتم تجميعها آلياً
        يتوجب عليك أن تعلم أنه من الممكن أن يتم جمع المعلومات والبيانات تلقائيا من خلال استخدام الملفات النصية (كوكيز). وهي ملفات صغيرة يتم من خلالها حفظ المعلومات الأساسية التي يستخدمها موقع الشبكة من أجل تحديد الاستخدامات المتكررة للموقع وعلى سبيل المثال، استرجاع اسمك إذا تم إدخاله مسبقا.

        لا تندمج هذه الملفات النصية ضمن نظام التشغيل الخاص بك ولا تؤذي ملفاتك. وإذا كنت تفضل عدم جمع المعلومات من خلال استخدام الملفات النصية، تستطيع اتباع إجراء بسيط من خلال معظم المتصفحات والتي تمكنّك من رفض خاصية تنزيل الملفات النصية.

        + البيانات التي تقوم بإدخالها

        النماذج التي يتم تعبئتها بواسطة زوار الموقع بشكل اختياري مثل نموذج التعليقات، او نموذج الاتصال بنا، حيث يقوم الزوار في هذه النماذج بتعبئة معلومات خاصة بهم مثل الاسم والبريد الالكتروني وغيرها، هذه المعلومات تستخدم للتواصل مع الزائر والإجابة عليه ونحو ذلك. ولا يتم تحت أي حال من الأحوال تقديم هذه المعلومات أو بيعها لطرف ثالث إلا في حال ورود طلب قضائي يستوجب كشف مثل هذه البيانات.

        ورغم ذلك، قد يتم كشف معلومات عامة للمعلنين لدينا مثل عدد الزوار يومياً ومعدل تصفح الصفحات في الموقع وغيرها من المعلومات الإحصائية التي لا تضر بخصوصية زوارنا.

        + ماذا نفعل بالمعلومات التي تقدم إلينا ؟

        لدى قيامك بإدخال المعلومات الخاصة بك (مثلا اسم المستخدم، الاسم الشخصي، بريد الكتروني)، فأنت توافق بأن نقوم نحن بالاحتفاظ بتلك المعلومات وذلك عن طريقنا أو عن طريق خدمات شركة تكون طرفا ثالثا يقوم بمعالجة هذه المعلومات بالنيابة عنا.

        يجوز لنا أن نستخدم المعلومات الخاصة بك، المشار اليها اعلاه وذلك حسب بنود سياسة الخصوصية هذه من أجل الأغراض التالية:

        إجراء تحليل إحصائي متعلق بسلوك الزوار، والتي يجوز لنا عرضها على أطراف ثالثة على نحو غير شخصي، وبشكل كلي؛

        تمكيننا من الإيفاء بكافة المتطلبات المفروضة علينا قانونيا؛

        إرسال مخاطبات دورية إليك(والتي تتضمن رسالة بريد إلكتروني) قد تكون رسالة او نشرة اخبارية.

        +التحديثات

        تستطيع أن تعلمنا بأي تحديثات، اوتعديلات، اوتصحيحات، تقوم بها على معلومات المستخدم التي قمنا بجمعها مسبقا من خلال استخدام رابط اتصل بنا الموجود على الموقع.

        قد نقوم بتغيير سياسة الخصوصية من وقت إلى آخر ولهذا يتعين عليك مراجعتها دوريا. ويكون استخدامك لموقعنا دلالة على قبول سياسة الخصوصية المطبقة في ذلك الوقت.

        نحتفظ بحقنا بتغيير أو تعديل أو تحديث سياسة الخصوصية هذه في أي وقت من الأوقات.

        +الرسائل البريدية

        تقوم ادارة الموقع بإرسال رسائل بريدية متنوعة لزوارها بشكل دوري، فبتسجيلك في قائمة النشرة البريدية فإنك توافق على استلام هذه الرسائل المتنوعة، علماً أن الموقع لا يقوم بإرسال رسائل دعائية مزعجة للآخرين Spam ، وأيضاً يوفر الموقع في أسفل كل رسالة رابط خاص لمن يرغب في إلغاء إشتراكه، وفي حالة وجود أي شكوى على خدمة الرسائل، بإمكانك إرسالها مباشرة إلينا عبر صفحة اتصل بنا الموجودة بالموقع.

        + إلغاء الاشتراك

        تستطيع عندما تريد سحب موافقتك على استلام رسائل دورية وذلك عن طريق الضغط على رابط “إلغاء الاشتراك” في الرسائل القادمة منا.

        + الروابط الخارجية

        يحتوي الموقع على روابط لمواقع أخرى خارجية، كما يستخدم مواقع وخدمات تقوم بتحليل إحصائيات الزوار، والموقع ليس مسؤول عن سياسة خصوصية تلك المواقع او محتوياتها، أو عن طريقة تجميعها للمعلومات، وبزيارتك لموقعنا، فإنك تقر بأحقيتنا في استخدام هذه الخدمات.

        بعض مواقع الانترنت قد يتغير عنوانها أو تتوقف عن العمل لمدة مؤقتة أو دائمة ونحن من جهتنا سنحاول حذف أو تعديل تلك الروابط قدر الامكان.

        هذا الموقع يستخدم اعلانات شركة غوغل ادسنس (Google adsense) وهذه الاعلانات قد تتسبب في عمل ملف كوكيز (cookies and web beacons) لجمع معلومات بسيطة غير شخصية عن الزائر مثل نوع المتفصح والتاريخ … مع العلم بأنها لا تسبب أي ضررا لحاسوبك ،ووجدت فقط لتحسين الخدمة والأداء.

        ملف تعريف الارتباط DoubleClick DART: تخزّن Google ملف تعريف ارتباط إعلان في متصفّح المستخدم لفهم أنواع الصفحات التي يزورها المستخدم. ويتمّ استخدام هذه المعلومات لعرض الإعلانات استنادًا إلى فئات الاهتمامات التي قد تجذب المستخدمين. يمكن للمستخدمين تعطيل استخدام ملف تعريف الارتباط DART بزيارة سياسة الخصوصية الخاصة بإعلانات Google وشبكة المحتوى.

        + حماية معلومات المستخدم الخاصة بك

        للأسف يعتبر إرسال البيانات عبر الإنترنت أمرا لا يمكن ضمانه على نحو كلي. ومع التزامنا التام بحماية معلومات المستخدم الخاصة بك، فإننا لا نستطيع ضمان أمان إرسال معلومات المستخدم الخاصة بك إلى الموقع. إن أي بيانات يتم إرسالها، بما في ذلك معلومات المستخدم الخاصة بك، تكون على مسؤوليتك أنت.

        من جانبنا فإننا نعي معايير الصناعة ونستخدم تطبيقات الأمان والحماية من أجل حماية معلومات المستخدم من أي اختراق غير مشروع أو إساءة استخدام. وعليه ولدى استخدامنا معلومات المستخدم فإننا نقوم بتطبيق إجراءات معايير الصناعة ومواصفات الأمن من أجل منع الوصول غير المشروع إلى معلومات المستخدم.

        + جمع البيانات

        عند استخدام الموقع قد تصادف مناطق مثل المنتديات أو خدمات الفيديو حيث يتم الطلب منك كمستخدم إدخال معلومات المستخدم الخاصة بك. يتم استخدام مثل معلومات المستخدم هذه فقط للهدف التي يتم جمعها من أجله، وأي أغراض أخرى يتم تحديدها في نقطة الجمع وذلك بالتوافق مع سياسة الخصوصية هذه. لن نقوم بالإفصاح عن أي من معلومات المستخدم التي توفرها لطرف ثالث دون إصدارك الموافقة على ذلك، باستثناء ضرورة توفير خدمات قمت بتحديد طلبها.

        + للاتصال بنا

        للاستفسار أو التعليق حول هذه السياسة الرجاء الاتصال بنا ( <Link to="/contact-us" style={{textDecoration: "none"}}>من هنا</Link>)
              </p>
            </div>
  )
}

export default PrivacyPolicy
