  export const details = [
  {
    id: 1,
    img: "https://livehd7.ws/uploads/news/6757ca0726e24.webp",
    title: "تشكيل ريال مدريد ضد أتالانتا في دوري أبطال أوروبا",
    description: "تشكيل ريال مدريد ضد أتالانتا في دوري أبطال أوروبا تشكيل ريال مدريد ضد أتالانتا، والذي استقر عليه المدرب الإيطالي، كارلو أنشيلوتي...",
  },
  {
    id: 2,
    img: "https://livehd7.ws/uploads/news/6746e890e33b5.jpg",
    title: "بعد إصابة فينيسيوس هل ينتهي كابوس مبابي في ريال مدريد؟",
    description: "عاش الفرنسي كيليان مبابي نجم ريال مدريد، حالة من التخبط والتراجع في المستوى منذ بداية الموسم الحالي.النجم الفرنسي...",
  },
  {
    id: 3,
    img: "https://livehd7.ws/uploads/news/67458c46f3451.jpg",
    title: "تشكيل الأهلي المتوقع أمام ستاد أبيدجان",
    description: "يواصل فريق الأهلي رحلة الدفاع عن لقبه القاري حين يستضيف ستاد أبيدجان في الجولة الأولى من منافسات المجموعة الثالثة بدوري...",
  },
  {
    id: 4,
    img: "https://livehd7.ws/uploads/news/6744f6293551d.jpg",
    title: "رونالدو يحصد جائزة جديدة بعد تألقه في مباراة الغرافة القطري",
    description: "حصد البرتغالي كريستيانو رونالدو، قائد النصر، جائزة جديدة مع الفريق بعد تألقه في مباراة الغرافة القطري بدوري النخبة الآسيوي....",
  },
  {
    id: 5,
    img: "https://livehd7.ws/uploads/news/6744f6851bc29.jpg",
    title: "مواعيد مباريات الإثنين 25 نوفمبر 2024 , دوري المحترفين وأبطال آسيا",
    description: "تختتم منافسات الجولة التاسعة من مسابقة دوري المحترفين المصري.لمعرفة كافة مواعيد مباريات اليوم والقنوات الناقلة من هنا....",
  },
  {
    id: 6,
    img: "https://livehd7.ws/uploads/news/6744f655e1519.jpg",
    title: "محمد صلاح يسجل مئوية جديدة تاريخية مع ليفربول",
    description: "واصل النجم المصري محمد صلاح تألقه مع ليفربول، بعدما سجل هدفين في مرمى ساوثهامبتون، مساء الأحد، ضمن الجولة 12 من...",
  },
]